import time

import numpy as np
import pandas as pd

current_timestamp = int(time.time())
# 设置随机种子以保证结果可重复
np.random.seed(current_timestamp)

# 定义数据大小
n = 10000

# 生成数据
data = {
    'ID': np.arange(n),
    'FloatValue': np.random.randn(n),
    'StringValue': [''.join(np.random.choice(list('abcdefghijklmnopqrstuvwxyz'), 10)) for _ in range(n)],
    'htmlValue': [''.join(np.random.choice(list("""<html ang="z-CN>edsycriu6290wfo.{:;}bOFx[H],p!/
腾讯网8qvXUAIE1_4573#K资新闻财经房产视频B科技QT从年创立至今，已成为集信息区域垂直生活服务、社会化媒体和品一的互联平台。下设娱乐育汽车时尚等多个道充分满足用户对不同类型需求专注领内容打造精栏目并顺应术发展趋势推出络播形式改变了获取方习惯kR|(L)&'?jSD日热点选门问答榜股市指数看板比赛前沿风向标教游戏重磅健康鲜事国际军电竞彩楼观察每普学要眼界球云斗罗大陆%码元梦之星历史儿理票无畏契约天气公告查询综艺影剧中扫黄非监督人民法院上有害举报字消费优营商环境卫士入口微浏览器音企鹅号宝议文档子签脑管家G可结欢地主念永恒V软件心币员阅读空间邮箱图全歌医典通P桌面整逆战穿越火线龙八部英雄盟王者荣耀涯明月刀马斯克“政府效率”招聘：高智零薪酬周工作超小ZWY感兴趣荐该减少此被伤硬汉记志曾因调赌博遭焯华次威胁MJ极瞭望思想楚都官账别具慧评手起建！百态据知情爆料办刊《济参考》程在安徽合铁七局施现场采访殴傍晚定远县警表示依规进行写弹性垫层割就开湖北这实是计划外按照来说真正确只印尼巴林两而随着我们击败决命运其将自于本组最后轮—以胜利彻底拿到压倒动权且也略得还另特色仙坛深客反绝杀？谁功臣连仅供浙江耗亿古城均卖张投万亏损紧急呼叫京旗旅攻南庸引关名片景诉系免项流量位他店低驻光山西横跨路米夜村骑撞幸身亡讲述价值故众瞩粉丝达交必拦虎隔终咬沁友布称昌镇某段架距慎抢救映题灾陕能源首突破辆预过意义十味业燃油转巨始强蜕早世纪代著钱森提认臻什么概未格挑传递解放岩岛备巡节织海兵力及边队逻戒住乡保付套央包含制独原析策控受贿余副长红案审庭检司美东州蔓延聚焦千锤炼测机统亮相珠航青蜂侠（）限严肃捞各角度质募即届样又怎呢头条池近抵席亚太第三导二秘鲁总迎仪谈语跟港般四当宫废弃冬绿贸稳增韧键词秋季才五坚持治籍岁里易税收双降舟些与论六瓜果飘香水稻金沙亩荒滩良田仓座何德鼎融链协激冰雪【响】党辟广阔尊捧饭碗承暖期待凯拉｜谊赓续好谱鉴篇九卿宣候束加冲虚伪班牙征益欧洲携拓遇卡•阿木尽努秦腔贡献疆圳丨塔玛干漠如锁剩炉快吧丽洱泉庆脉章物致馆谐共·团圆春奖牌@+*盲使操请捷；详细顶霾℃搜索端障碍缘灭浓淡更令钟暂停循清晰准倍速言轨静恢复画页屏你刷试闭核显帧缓辨编敢爹诈老陈辞职悔回把浪尖但没再丑遮俊单话接忙甚给添麻烦择脱份继断赞女列裙短便裤装吗阳黑聊让忆犹然室繁居唠嗑那简几须攀爬毁判赔支算额神💤杂邀难研讨括估偿探己蟒峰根积追帅伊半先澳赶课倔缺够临挥初错失觉惋惜乏土耳若帮常例俄乌兰假旦防守花飞跃屯搭唱祖师爷况种徒弟吐槽律声很见或做伟购退买恭喜执存刺颁孩母亲男砍处凶拘留罪病皮肤裂左抑郁状窦罚书修夸烧死鸟耻勇…许异赢啥忘衰泱凑韩撰落姆佩曝驰骋茵虽负夫瞎所悬挺句描庞催厘虑魔否担忧龄矮婚恋似乎恐痛谓促仿椰树拆除掉傻块钢构棵右贵颗基础坐凳撑孕妇送却梯胎范围涉委级附属廷胀莱奇迹哈维尔去任带锯臂膀斧革食涨餐垃圾桶脂酒朝沟厂柴怕兜李佳柒证晶册纷争驳姓锋夺瞻排绩杯裁斤野猪校配犬栖默械置狩猎扰危较峻屡序省护农疯狂鱼玩离它氏骗跌镜诞盈赚差哪白熟庄凤凰挡听盆钵措群款尤刚善唤毕竟宏奸刑敲勒宋挽刘犯既乒福冈樊振奥违赋愿莫阻晋贯伴钦胯胖掏旧屋寿啊责由仇遍埃滑仍她慢奏模夏归炒替沸掌柜享扩升培训诸岗谋矿贩毒掠吨霉找紫乃富截止换麦琳矛盾碰妈霸弱捏密琴握谍潜毅坑撕脸宇宁批演巷丞惹怒午巅困拥抱晓纯叶珂挖缩沪琼纳爵顾昔雷霆塞鹿猛步篮鹰牛版派秒赴幻冒险途剑忍帖刃启疾返帝愈休闲桃棋盛脚隐私洽载侵诺站粤宗函药浮钮馈您登录宽"""), 100)) for _ in range(n)],

}

# 创建DataFrame
df = pd.DataFrame(data)
print(df)
# 输出为Parquet文件
output_file = 'random_data.orc'
df.to_orc(output_file, engine='pyarrow', engine_kwargs={'compression': 'uncompressed'})

print(f"Data has been written to {output_file}")
